Revit 2027 API
Element.IsPhaseCreatedValid Method
 Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPhaseCreatedValid(
	ElementId createdPhaseId
)
Public Function IsPhaseCreatedValid (
	createdPhaseId As ElementId
) As Boolean
public:
bool IsPhaseCreatedValid(
	ElementId^ createdPhaseId
)
member IsPhaseCreatedValid :
        createdPhaseId : ElementId -> bool
Parameters
createdPhaseId ElementId
 The id of a Phase.
Return Value
Boolean
 True if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Acts as a validator for setting the property CreatedPhaseId.
See Also
Reference
Element Class
Autodesk.Revit.DB Namespace